settlingBed_polyDisp_break_converged/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    populationBalanceTwoPhaseSystem;

phases (solid water);

populationBalances (particles);

solid
{
    type          pureIsothermalPhaseModel; // can be used? observed that tutorial case usually uses purePhaseModel 
    diameterModel velocityGroup;

    velocityGroupCoeffs
    {
	populationBalance	particles;
	
	formFactor	0.5235987756;
	
	sizeGroups
	(
	     f0{d 11.6e-6; value 0;}
	     f1{d 21.6e-6; value 0;}
	     f2{d 31.6e-6; value 0;}
	     f3{d 41.6e-6; value 0;}
	     f4{d 51.6e-6; value 0;}
	     f5{d 61.6e-6; value 0;} // Amount per volume fraction
	     f6{d 71.6e-6; value 1;}
	);
    }

    alphaMax        0.07;
    residualAlpha   1e-6;
}

water
{
    type          pureIsothermalPhaseModel;

    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }

    residualAlpha   0;
}

populationBalanceCoeffs // For breakage models
{
    particles
    {
        continuousPhase water;

        coalescenceModels
        ();

        binaryBreakupModels
        ();

        breakupModels
        (
	    exponential // rate Kernel
            {
                C 1000; // base rate - accelerated to view impact on simulation
                exponent 0.1; 
                daughterSizeDistributionModel uniformBinary; // breakage Kernel. Currently 1 for all sizes.
            }
	);

        driftModels
        (
	    //densityChange{} // Accounts for different velocities for different sizes (due to different drag effects as drag is affected by surface area)
	);

        nucleationModels
        ();
    }
}


blending
{
    default
    {
        type            none;
        continuousPhase water;
    }
}

surfaceTension
(
    (water and solid)
    {
        type            constant;
        sigma           0.073;
    }
);


aspectRatio
(
);

drag
(
    (solid in water)
    {
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
);

heatTransfer
(
    (solid in water) // for pureIsothermalPhaseModel this is redundant.
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
);

phaseTransfer
(
);

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
